DataProcessors/ОформлениеПроданныхТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОформлениеПроданныхТОХ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТоварыКВыкупуСРегистраторами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзначальное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПроизводителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиВДокументе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиТохДляРассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоставщикТОХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставщикиТОХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектроннаяПочта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выкуп</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыкупСОтветственногоХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыТОХпоДаннымПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыТОХпоДаннымПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХраненияПереданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХраненияПереданные</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизацийМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизацийМТ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияОфромленияТОХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОфромленияТОХ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СписокТоваров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФормированияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыкупСОтветственногоХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОформлениеПроданныхТОХ/Ext/ObjectModule.bsl
Функция ПолучитьЗапросCоответствиеРегистровТоварыТОХиТоварыТОХпоставщиков() Экспорт 
	
	Текст = "ВЫБРАТЬ
	        |	ТЗ_Выкуп.Организация,
	        |	ТЗ_Выкуп.Контрагент,
	        |	ТЗ_Выкуп.ДоговорКонтрагента,
	        |	ТЗ_Выкуп.Номенклатура,
	        |	ВЫБОР
	        |		КОГДА &УчитыватьВыкуп
	        |			ТОГДА ТЗ_Выкуп.КоличествоТОХПоставщики
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоТОХПоставщики
			//+ Кривова З. 06.11.2024 #UT10-4884
	        //|ПОМЕСТИТЬ ВТ_ТоварыКВыкупу
	        |ПОМЕСТИТЬ ВТ_ТоварыКВыкупу0
			//- Кривова З. 06.11.2024 #UT10-4884
	        |ИЗ
	        |	&ТЗ_Выкуп КАК ТЗ_Выкуп
	        |;
			//+ Кривова З. 06.11.2024 #UT10-4884
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТЗ_Выкуп.Организация,
	        |	ТЗ_Выкуп.Контрагент,
	        |	ТЗ_Выкуп.ДоговорКонтрагента,
	        |	ТЗ_Выкуп.Номенклатура,
	        |	СУММА(ТЗ_Выкуп.КоличествоТОХПоставщики) КАК КоличествоТОХПоставщики
	        |ПОМЕСТИТЬ ВТ_ТоварыКВыкупу
	        |ИЗ
	        |	ВТ_ТоварыКВыкупу0 КАК ТЗ_Выкуп
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТЗ_Выкуп.ДоговорКонтрагента,
	        |	ТЗ_Выкуп.Контрагент,
	        |	ТЗ_Выкуп.Номенклатура,
	        |	ТЗ_Выкуп.Организация
	        |;
	        |
			//- Кривова З. 06.11.2024 #UT10-4884
	        |
	        |//////////////////////////// ////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТоварыКВыкупу.Организация,
	        |	ВТ_ТоварыКВыкупу.Контрагент,
	        |	ВТ_ТоварыКВыкупу.ДоговорКонтрагента,
	        |	ВТ_ТоварыКВыкупу.Номенклатура,
	        |	0 КАК КоличествоТОХ,
	        |	ВТ_ТоварыКВыкупу.КоличествоТОХПоставщики КАК КоличествоТОХПоставщики,
	        |	0 КАК КоличествоТОХПереданные
	        |ПОМЕСТИТЬ ВТ_НаборДанных
	        |ИЗ
	        |	ВТ_ТоварыКВыкупу КАК ВТ_ТоварыКВыкупу
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТоварыОтветственногоХраненияОстатки.Организация,
	        |	ТоварыОтветственногоХраненияОстатки.Контрагент,
	        |	ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента,
	        |	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	        |	СУММА(ЕСТЬNULL(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток, 0)),
	        |	СУММА(0),
	        |	СУММА(0)
	        |ИЗ
	        |	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	        |			&Дата,
	        |			Контрагент = &Контрагент
	        |				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТоварыОтветственногоХраненияОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента,
	        |	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	        |	ТоварыОтветственногоХраненияОстатки.Контрагент,
	        |	ТоварыОтветственногоХраненияОстатки.Организация
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Организация,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Контрагент,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Договор,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура,
	        |	СУММА(0),
	        |	СУММА(ЕСТЬNULL(ТоварыТОХпоДаннымПоставщиковОстатки.КоличествоОстаток, 0)),
	        |	СУММА(0)
	        |ИЗ
	        |	РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(
	        |			&Дата,
	        |			Контрагент = &Контрагент
	        |				И Договор = &ДоговорКонтрагента) КАК ТоварыТОХпоДаннымПоставщиковОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Договор,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Контрагент,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура,
	        |	ТоварыТОХпоДаннымПоставщиковОстатки.Организация
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Организация,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Контрагент,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура,
	        |	СУММА(0),
	        |	СУММА(0),
	        |	СУММА(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток)
	        |ИЗ
	        |	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	        |			&Дата,
	        |			Контрагент = &Контрагент
	        |				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТоварыОтветственногоХраненияПереданныеОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Организация,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Контрагент,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента,
	        |	ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_НаборДанных.Контрагент,
	        |	ВТ_НаборДанных.ДоговорКонтрагента,
	        |	ВТ_НаборДанных.Номенклатура,
	        |	СУММА(ВТ_НаборДанных.КоличествоТОХ) КАК КоличествоТОХ,
	        |	СУММА(ВТ_НаборДанных.КоличествоТОХПоставщики) КАК КоличествоТОХПоставщики,
	        |	СУММА(ВТ_НаборДанных.КоличествоТОХПоставщики - ВТ_НаборДанных.КоличествоТОХ) КАК Разница,
	        |	СУММА(ВТ_НаборДанных.КоличествоТОХПереданные) КАК КоличествоТОХПереданные,
	        |	МАКСИМУМ(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК СкладОстаток,
	        |	МАКСИМУМ(ТоварыОрганизацийМТОстатки.КоличествоОстаток) КАК МТОстаток,
	        |	МАКСИМУМ(ВТ_ТоварыКВыкупу.КоличествоТОХПоставщики) КАК КоличествоВыкупа
	        |ПОМЕСТИТЬ ВТ_Итоговая
	        |ИЗ
	        |	ВТ_НаборДанных КАК ВТ_НаборДанных
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, ) КАК ТоварыНаСкладахОстатки
	        |		ПО ВТ_НаборДанных.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизацийМТ.Остатки(&Дата, ) КАК ТоварыОрганизацийМТОстатки
	        |		ПО ВТ_НаборДанных.Номенклатура = ТоварыОрганизацийМТОстатки.Номенклатура
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыКВыкупу КАК ВТ_ТоварыКВыкупу
	        |		ПО ВТ_НаборДанных.Организация = ВТ_ТоварыКВыкупу.Организация
	        |			И ВТ_НаборДанных.Контрагент = ВТ_ТоварыКВыкупу.Контрагент
	        |			И ВТ_НаборДанных.ДоговорКонтрагента = ВТ_ТоварыКВыкупу.ДоговорКонтрагента
	        |			И ВТ_НаборДанных.Номенклатура = ВТ_ТоварыКВыкупу.Номенклатура
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_НаборДанных.Номенклатура,
	        |	ВТ_НаборДанных.Контрагент,
	        |	ВТ_НаборДанных.ДоговорКонтрагента
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Итоговая.Контрагент,
	        |	ВТ_Итоговая.ДоговорКонтрагента,
	        |	ВТ_Итоговая.Номенклатура,
	        |	ВТ_Итоговая.КоличествоВыкупа,
	        |	ВТ_Итоговая.СкладОстаток КАК КоличествоСклад,
			//+ Кривова З. 06.11.2024 #UT10-4884
	        //|	ВТ_Итоговая.МТОстаток + ВТ_Итоговая.КоличествоВыкупа КАК КоличествоМТ,
	        |	ВТ_Итоговая.МТОстаток - ВТ_Итоговая.КоличествоВыкупа КАК КоличествоМТ,
			//- Кривова З. 06.11.2024 #UT10-4884
	        |	ВТ_Итоговая.КоличествоТОХ,
	        |	ВТ_Итоговая.КоличествоТОХПереданные,
	        |	ВТ_Итоговая.КоличествоТОХПоставщики,
			//+ Кривова З. 06.11.2024 #UT10-4884
	        //|	ВТ_Итоговая.МТОстаток + ВТ_Итоговая.КоличествоВыкупа КАК Метрика_1,
	        |	ВТ_Итоговая.МТОстаток - ВТ_Итоговая.КоличествоВыкупа КАК Метрика_1,
	        //|	ВТ_Итоговая.СкладОстаток - (ВТ_Итоговая.МТОстаток + ВТ_Итоговая.КоличествоВыкупа) - ВТ_Итоговая.КоличествоТОХПоставщики + ВТ_Итоговая.КоличествоТОХПереданные КАК Метрика_2,
	        |	ВТ_Итоговая.СкладОстаток - (ВТ_Итоговая.МТОстаток - ВТ_Итоговая.КоличествоВыкупа) - ВТ_Итоговая.КоличествоТОХПоставщики + ВТ_Итоговая.КоличествоТОХПереданные КАК Метрика_2,
			//- Кривова З. 06.11.2024 #UT10-4884
	        |	ВТ_Итоговая.Разница КАК Метрика_3,
			//+ Кривова З. 11.11.2024 #UT10-4880
	        |	ВТ_Итоговая.КоличествоТОХ - ВТ_Итоговая.КоличествоТОХПереданные КАК Метрика_5
			//- Кривова З. 11.11.2024 #UT10-4880
	        |ПОМЕСТИТЬ ВТ_Метрики
	        |ИЗ
	        |	ВТ_Итоговая КАК ВТ_Итоговая
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Метрики.Контрагент,
	        |	ВТ_Метрики.ДоговорКонтрагента,
	        |	ВТ_Метрики.Номенклатура,
	        |	-ВТ_Метрики.КоличествоВыкупа КАК КоличествоВыкупа,
	        |	ВТ_Метрики.КоличествоСклад,
	        |	ВТ_Метрики.КоличествоМТ,
	        |	ВТ_Метрики.КоличествоТОХ,
	        |	ВТ_Метрики.КоличествоТОХПереданные,
	        |	ВТ_Метрики.КоличествоТОХПоставщики,
	        |	ВТ_Метрики.Метрика_1,
	        |	ВТ_Метрики.Метрика_2,
	        |	ВТ_Метрики.Метрика_3,
			//+ Кривова З. 11.11.2024 #UT10-4880
	        |	ВТ_Метрики.Метрика_5
			//- Кривова З. 11.11.2024 #UT10-4880
	        |ИЗ
	        |	ВТ_Метрики КАК ВТ_Метрики
	        |ГДЕ
	        |	(ВТ_Метрики.Метрика_1 < 0
	        |			ИЛИ ВТ_Метрики.Метрика_2 <> 0
	        |			ИЛИ ВТ_Метрики.Метрика_3 <> 0
	        |			ИЛИ ВТ_Метрики.Метрика_5 < 0)";
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТоварыТОХДляВыкупа(НачПериода, КонПериода, ПоставщикТОХ, ВыбКонтрагент, ВыбДоговор) Экспорт  
	
	//+Шульман А. 21.06.2024 #UT10-4521
	мТоварыКВыкупу = Неопределено;
	мТоварыКВыкупуСРегистраторами = Неопределено;   
	
	ЗапросПроданныхТоваров = Новый Запрос;
	
	Если Константы.ДобавлятьОтрицательныйОстатокМТкВыкупу.Получить() Тогда
		
		ЗапросПроданныхТоваров.Текст =
		"ВЫБРАТЬ
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Артикул КАК Артикул,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Родитель КАК Производитель,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.СерияНоменклатуры,
		|	СУММА(ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход) КАК КоличествоТОХ,
		|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1) КАК Цена,
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1) * ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход) КАК Сумма,
		|	ВЫБОР
		|		КОГДА &РазделятьВыкупы
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|							И ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал.НеОбъединятьВОбщемВыкупе
		|						ТОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Филиал
		|ПОМЕСТИТЬ ОстаткиТОХсЦенами
		|ИЗ
		|	РегистрНакопления.ТоварыОтветственногоХранения.ОстаткиИОбороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			,
		|			Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &Договор) КАК ТоварыОтветственногоХраненияОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
		//+Шульман А. 16.12.2024 #UT10-4992    
		|     И &УсловиеПеремещениеНеликвидаТОХвГП 
		//-Шульман А. 16.12.2024 #UT10-4992
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ТребованиеНакладная)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.СписаниеТоваров)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ПеремещениеТоваров)   
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.КорректировкаПоступления)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|				И НЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И НЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТОХ.ВозвратПоБраку))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.СерияНоменклатуры,
		|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1),
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Артикул,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.КодПроизводителя,
		|	ВЫБОР
		|		КОГДА &РазделятьВыкупы
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|							И ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал.НеОбъединятьВОбщемВыкупе
		|						ТОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОрганизацийМТОстатки.Склад,
		|	ТоварыОрганизацийМТОстатки.Номенклатура,
		|	СУММА(ТоварыОрганизацийМТОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстаткиМТ
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийМТ.Остатки(
		|			&ДатаОкончания,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					Табл.Номенклатура
		|				ИЗ
		|					ОстаткиТОХсЦенами КАК Табл)) КАК ТоварыОрганизацийМТОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОрганизацийМТОстатки.Склад,
		|	ТоварыОрганизацийМТОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиМТ.Номенклатура,
		|	СУММА(-ОстаткиМТ.КоличествоОстаток) КАК ОтрМТ
		|ПОМЕСТИТЬ ОтрицОстаткиМТ
		|ИЗ
		|	ОстаткиМТ КАК ОстаткиМТ
		|ГДЕ
		|	ОстаткиМТ.КоличествоОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиМТ.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТОХсЦенами.Номенклатура,
		|	ОстаткиТОХсЦенами.Артикул,
		|	ОстаткиТОХсЦенами.Производитель,
		|	ОстаткиТОХсЦенами.КодПроизводителя,
		|	ОстаткиТОХсЦенами.СерияНоменклатуры,
		|	ОстаткиТОХсЦенами.Цена,
		|	ОстаткиТОХсЦенами.Сумма,
		|	ОстаткиТОХсЦенами.Филиал,
		|	ОстаткиТОХсЦенами.КоличествоТОХ,
		|	ЕСТЬNULL(ТоварыТОХпоДаннымПоставщиковОстатки.КоличествоОстаток, 0) КАК ОстатокТОХПост,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОтрицОстаткиМТ.ОтрМТ, 0) - ОстаткиТОХсЦенами.КоличествоТОХ > 0
		|			ТОГДА ЕСТЬNULL(ОтрицОстаткиМТ.ОтрМТ, 0) - ОстаткиТОХсЦенами.КоличествоТОХ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтрМТуточн,
		|	ЕСТЬNULL(ОтрицОстаткиМТ.ОтрМТ, 0) КАК ОтрМТ
		|ПОМЕСТИТЬ ОбщТабл
		|ИЗ
		|	ОстаткиТОХсЦенами КАК ОстаткиТОХсЦенами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(
		|				&ДатаОкончания,
		|				Контрагент = &Контрагент
		|					И Договор = &Договор
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							Табл.Номенклатура
		|						ИЗ
		|							ОстаткиТОХсЦенами КАК Табл)) КАК ТоварыТОХпоДаннымПоставщиковОстатки
		|		ПО ОстаткиТОХсЦенами.Номенклатура = ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтрицОстаткиМТ КАК ОтрицОстаткиМТ
		|		ПО ОстаткиТОХсЦенами.Номенклатура = ОтрицОстаткиМТ.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбщТабл.Номенклатура,
		|	ОбщТабл.Артикул,
		|	ОбщТабл.Производитель КАК Производитель,
		|	ОбщТабл.КодПроизводителя КАК КодПроизводителя,
		|	ОбщТабл.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА ОбщТабл.КоличествоТОХ >= ОбщТабл.ОстатокТОХПост
		|			ТОГДА ОбщТабл.КоличествоТОХ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ОбщТабл.КоличествоТОХ + ОбщТабл.ОтрМТуточн < ОбщТабл.ОстатокТОХПост
		|					ТОГДА ОбщТабл.КоличествоТОХ + ОбщТабл.ОтрМТуточн
		|				ИНАЧЕ ОбщТабл.ОстатокТОХПост
		|			КОНЕЦ
		|	КОНЕЦ КАК Количество,
		|	ОбщТабл.Цена,
		|	ОбщТабл.Сумма,
		|	ОбщТабл.Филиал
		|ИЗ
		|	ОбщТабл КАК ОбщТабл
		|
		|УПОРЯДОЧИТЬ ПО
		|	Производитель,
		|	КодПроизводителя";
		
	Иначе
		
		ЗапросПроданныхТоваров.Текст =
		"ВЫБРАТЬ
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Артикул КАК Артикул,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Родитель КАК Производитель,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.СерияНоменклатуры,
		|	СУММА(ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход) КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1) КАК Цена,
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1) * ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход) КАК Сумма,
		|	ВЫБОР
		|		КОГДА &РазделятьВыкупы
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|							И ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал.НеОбъединятьВОбщемВыкупе
		|						ТОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Филиал
		|ИЗ
		|	РегистрНакопления.ТоварыОтветственногоХранения.ОстаткиИОбороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			,
		|			Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &Договор) КАК ТоварыОтветственногоХраненияОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)   
		//+Шульман А. 16.12.2024 #UT10-4992    
		|     И &УсловиеПеремещениеНеликвидаТОХвГП 
		//-Шульман А. 16.12.2024 #UT10-4992
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ТребованиеНакладная)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.СписаниеТоваров)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ПеремещениеТоваров)   
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.КорректировкаПоступления)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|				И НЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И НЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТОХ.ВозвратПоБраку))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.СерияНоменклатуры,
		|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 1),
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Артикул,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура.КодПроизводителя,
		|	ВЫБОР
		|		КОГДА &РазделятьВыкупы
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
		|							И ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал.НеОбъединятьВОбщемВыкупе
		|						ТОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Филиал
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Производитель,
		|	КодПроизводителя"; 
		
	КонецЕсли;
	
	ЗапросПроданныхТоваров.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
	ЗапросПроданныхТоваров.УстановитьПараметр("ДатаОкончания", КонецДня(КонПериода));
	ЗапросПроданныхТоваров.УстановитьПараметр("Контрагент", ВыбКонтрагент);
	ЗапросПроданныхТоваров.УстановитьПараметр("Договор", ВыбДоговор); 
	ЗапросПроданныхТоваров.УстановитьПараметр("ТипЦен", ВыбДоговор.ТипЦен);
	ЗапросПроданныхТоваров.УстановитьПараметр("РазделятьВыкупы", ПоставщикТОХ.РазделятьВыкупы);
	
	//+Шульман А. 16.12.2024 #UT10-4992
	Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина Тогда
		
		ЗапросПроданныхТоваров.Текст = СтрЗаменить(ЗапросПроданныхТоваров.Текст, "&УсловиеПеремещениеНеликвидаТОХвГП", 
		"      НЕ ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП) 
		|     И ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).ДоговорПоставщикаТОХ = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)" );
		
	Иначе
		ЗапросПроданныхТоваров.Текст = СтрЗаменить(ЗапросПроданныхТоваров.Текст, "И &УсловиеПеремещениеНеликвидаТОХвГП", " ");
	КонецЕсли;	
	//-Шульман А. 16.12.2024 #UT10-4992
		
	РезультатЗапросаПроданных = ЗапросПроданныхТоваров.Выполнить();
	
	Если НЕ РезультатЗапросаПроданных.Пустой() Тогда
		мТоварыКВыкупу = РезультатЗапросаПроданных.Выгрузить();
	КонецЕсли;
	
	
	ЗапросПроданныхТоваров = Новый Запрос;
	ЗапросПроданныхТоваров.Текст =
	"ВЫБРАТЬ
	|	ТоварыОтветственногоХранения.Номенклатура,
	|	ТоварыОтветственногоХранения.СерияНоменклатуры,
	|	ТоварыОтветственногоХранения.Номенклатура.Артикул КАК Артикул,
	|	ТоварыОтветственногоХранения.Номенклатура.Родитель КАК Производитель,
	|	ТоварыОтветственногоХранения.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ТоварыОтветственногоХранения.Регистратор,
	|	ТоварыОтветственногоХранения.НомерСтроки КАК НомерСтрокиВДокументе,
	|	ТоварыОтветственногоХранения.Количество,
	|	ВЫБОР
	|		КОГДА &РазделятьВыкупы
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
	|							И ТоварыОтветственногоХранения.Регистратор.Филиал.НеОбъединятьВОбщемВыкупе
	|						ТОГДА ТоварыОтветственногоХранения.Регистратор.Филиал
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Филиал,
	|	ТоварыОтветственногоХранения.Количество КАК КоличествоИзначальное
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения КАК ТоварыОтветственногоХранения
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)    
	//+Шульман А. 16.12.2024 #UT10-4992    
	|     И &УсловиеПеремещениеНеликвидаТОХвГП 
	//-Шульман А. 16.12.2024 #UT10-4992
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.ТребованиеНакладная)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.СписаниеТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.ПеремещениеТоваров)  
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.КорректировкаПоступления)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыОтветственногоХранения.Регистратор.Ссылка) = ТИП(Документ.ВыкупСОтветственногоХранения)
	|				И НЕ ТоварыОтветственногоХранения.Регистратор.Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И НЕ ТоварыОтветственногоХранения.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТОХ.ВозвратПоБраку))
	|	И ТоварыОтветственногоХранения.Контрагент = &Контрагент
	|	И ТоварыОтветственногоХранения.ДоговорКонтрагента = &Договор
	|	И ТоварыОтветственногоХранения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТоварыОтветственногоХранения.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	ЗапросПроданныхТоваров.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
	ЗапросПроданныхТоваров.УстановитьПараметр("ДатаОкончания", КонецДня(КонПериода));
	ЗапросПроданныхТоваров.УстановитьПараметр("Контрагент", ВыбКонтрагент);
	ЗапросПроданныхТоваров.УстановитьПараметр("Договор", ВыбДоговор); 
	ЗапросПроданныхТоваров.УстановитьПараметр("ТипЦен", ВыбДоговор.ТипЦен);
	ЗапросПроданныхТоваров.УстановитьПараметр("РазделятьВыкупы", ПоставщикТОХ.РазделятьВыкупы);
	
	//+Шульман А. 16.12.2024 #UT10-4992
	Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина Тогда
		
		ЗапросПроданныхТоваров.Текст = СтрЗаменить(ЗапросПроданныхТоваров.Текст, "&УсловиеПеремещениеНеликвидаТОХвГП", 
		"      НЕ ВЫРАЗИТЬ(ТоварыОтветственногоХранения.Регистратор КАК Документ.РеализацияТоваровУслуг).ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП) 
		|     И ВЫРАЗИТЬ(ТоварыОтветственногоХранения.Регистратор КАК Документ.РеализацияТоваровУслуг).ДоговорПоставщикаТОХ = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)" );
		
	Иначе
		ЗапросПроданныхТоваров.Текст = СтрЗаменить(ЗапросПроданныхТоваров.Текст, "И &УсловиеПеремещениеНеликвидаТОХвГП", " ");
	КонецЕсли;	
	//-Шульман А. 16.12.2024 #UT10-4992
	
	РезультатЗапросаПроданных = ЗапросПроданныхТоваров.Выполнить();
	
	Если НЕ РезультатЗапросаПроданных.Пустой() Тогда
		мТоварыКВыкупуСРегистраторами = РезультатЗапросаПроданных.Выгрузить();
	КонецЕсли;
	
    Результат = Новый Структура("ТоварыКВыкупу, ТоварыКВыкупуСРегистраторами", мТоварыКВыкупу, мТоварыКВыкупуСРегистраторами);
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьДокументыВыкупа(НачПериода, КонПериода, ВыбКонтрагент, ВыбДоговор, ТоварыКВыкупу, ТоварыКВыкупуСРегистраторами, ЭтоРегЗадание) Экспорт
	
	КомментарийРегЗадание = "Сформирован регламентным заданием " + СокрЛП(ТекущаяДата()) + " ";
	
	СписокФилиалов = ТоварыКВыкупу.Скопировать(,"Филиал");
	СписокФилиалов.Свернуть("Филиал");
	СписокФилиалов.Сортировать("Филиал Возр");
	
	Для Каждого СтрокаСпискаФилиалов Из СписокФилиалов Цикл
		
		НовыйВыкуп = Документы.ВыкупСОтветственногоХранения.СоздатьДокумент();
		НовыйВыкуп.Дата = КонецДня(КонПериода);		
		НовыйВыкуп.Контрагент = ВыбКонтрагент; 
		НовыйВыкуп.ДоговорКонтрагента = ВыбДоговор;
		НовыйВыкуп.ВалютаДокумента = ВыбДоговор.ВалютаВзаиморасчетов; 
		НовыйВыкуп.КурсВзаиморасчетов = 1;
		НовыйВыкуп.КратностьВзаиморасчетов = 1;
		НовыйВыкуп.Организация = ВыбДоговор.Организация;
		НовыйВыкуп.Склад = Константы.ОсновнойСклад.Получить();			
		НовыйВыкуп.Статус = Перечисления.СтатусыТОХ.Подготовлен;
		НовыйВыкуп.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		НовыйВыкуп.НачалоПериода = НачалоДня(НачПериода);
		НовыйВыкуп.КонецПериода = КонецДня(КонПериода); 
		
		НовыйВыкуп.Комментарий = ?(ЭтоРегЗадание, КомментарийРегЗадание, "");
		
		Если ЗначениеЗаполнено(СтрокаСпискаФилиалов.Филиал) Тогда
			НовыйВыкуп.Комментарий = НовыйВыкуп.Комментарий + "По филиалу " + СокрЛП(СтрокаСпискаФилиалов.Филиал.Наименование);
		КонецЕсли;				
		
		СтрокиТоваровКВыкупуПоФилиалу = ТоварыКВыкупу.НайтиСтроки(Новый Структура("Филиал", СтрокаСпискаФилиалов.Филиал));		
		
		Для Каждого СтрокаОтобранныхТоваров Из СтрокиТоваровКВыкупуПоФилиалу Цикл
			
			НоваяСтрокаВыкуп = НовыйВыкуп.Товары.Добавить();
			НоваяСтрокаВыкуп.Номенклатура = СтрокаОтобранныхТоваров.Номенклатура;
			НоваяСтрокаВыкуп.ЕдиницаИзмерения = НоваяСтрокаВыкуп.Номенклатура.ЕдиницаХраненияОстатков;
			НоваяСтрокаВыкуп.Коэффициент =  НоваяСтрокаВыкуп.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрокаВыкуп.СерияНоменклатуры = СтрокаОтобранныхТоваров.СерияНоменклатуры;
			НоваяСтрокаВыкуп.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			НоваяСтрокаВыкуп.Количество = СтрокаОтобранныхТоваров.Количество;
			НоваяСтрокаВыкуп.Цена = СтрокаОтобранныхТоваров.Цена;
			НоваяСтрокаВыкуп.Сумма = НоваяСтрокаВыкуп.Количество*НоваяСтрокаВыкуп.Цена;
			
		КонецЦикла;   
		
		СтрокиТоваровКВыкупуСРегистраторамиПоФилиалу = ТоварыКВыкупуСРегистраторами.Скопировать(Новый Структура("Филиал", СтрокаСпискаФилиалов.Филиал));		
		
		Для Каждого Стр Из СтрокиТоваровКВыкупуСРегистраторамиПоФилиалу Цикл
			
			НоваяСтрокаОснований = НовыйВыкуп.ДокументыОснованияВыкупаТОХ.Добавить();
			НоваяСтрокаОснований.ДокументОснование = Стр.Регистратор;
			НоваяСтрокаОснований.Номенклатура = Стр.Номенклатура;
			НоваяСтрокаОснований.СерияНоменклатуры = Стр.СерияНоменклатуры;
			НоваяСтрокаОснований.Количество = Стр.Количество;
			
		КонецЦикла;
		
		НовыйВыкуп.Записать(РежимЗаписиДокумента.Запись);      
		ЗаписьВРегистрИсторияОфромленияТОХ(НовыйВыкуп.Ссылка, НачПериода, КонПериода, ВыбКонтрагент, СтрокиТоваровКВыкупуСРегистраторамиПоФилиалу);
		
		Попытка
			
			НовыйВыкуп.Записать(РежимЗаписиДокумента.Проведение);   
			
			Если ЭтоРегЗадание Тогда
				ЗаписьЖурналаРегистрации("Формирование выкупов ТОХ", УровеньЖурналаРегистрации.Информация, , ,
				"Создан выкуп для контрагента  " + СокрЛП(ВыбКонтрагент.Наименование));
			КонецЕсли;
			
		Исключение  
			
			//+Гавриленков В. 26.09.2024 #UT10-4793
			Если ЭтоРегЗадание Тогда
				ЗаписьЖурналаРегистрации("Формирование выкупов ТОХ", УровеньЖурналаРегистрации.Ошибка, , ,
				"Ошибка проведения выкуп для контрагента  " + СокрЛП(ВыбКонтрагент.Наименование) + ". " + ОписаниеОшибки());
			КонецЕсли; 
			//-Гавриленков В. 26.09.2024 #UT10-4793
			
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры       

Процедура ЗаписьВРегистрИсторияОфромленияТОХ(НовыйВыкуп, НачПериода, КонПериода, ВыбКонтрагент, СтрокиТоваровКВыкупуСРегистраторамиПоФилиалу)
	
	ЗаписьИОТ = РегистрыСведений.ИсторияОфромленияТОХ.СоздатьМенеджерЗаписи();
	ЗаписьИОТ.Документ    	   = НовыйВыкуп;
	СтруктураТоваров 		   = Новый Структура("СписокТоваров", СтрокиТоваровКВыкупуСРегистраторамиПоФилиалу); 
	ЗаписьИОТ.СписокТоваров    = Новый ХранилищеЗначения(СтруктураТоваров, Новый СжатиеДанных(9));
	ЗаписьИОТ.Поставщик        = ВыбКонтрагент;
	ЗаписьИОТ.НачалоПериода    = НачПериода;
	ЗаписьИОТ.ОкончаниеПериода = КонПериода;
	ЗаписьИОТ.ДатаФормированияДокументов = ТекущаяДата();
	ЗаписьИОТ.Записать();
	
КонецПроцедуры
